; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l10-t1-p5---int100n150-m25---int100c150---s180---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level19 level69)
(sum level50 level21 level71)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level19 level70)
(sum level51 level21 level72)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level19 level71)
(sum level52 level21 level73)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level19 level72)
(sum level53 level21 level74)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level19 level73)
(sum level54 level21 level75)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level19 level74)
(sum level55 level21 level76)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level19 level75)
(sum level56 level21 level77)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level19 level76)
(sum level57 level21 level78)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level19 level77)
(sum level58 level21 level79)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level19 level78)
(sum level59 level21 level80)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level19 level79)
(sum level60 level21 level81)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level19 level80)
(sum level61 level21 level82)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level19 level81)
(sum level62 level21 level83)
(sum level62 level22 level84)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level19 level82)
(sum level63 level21 level84)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level19 level83)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level19 level84)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level4 level73)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level4 level74)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level4 level75)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level4 level76)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level4 level77)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level9 level82)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level4 level78)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level9 level83)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level4 level79)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level9 level84)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level4 level80)
(sum level76 level5 level81)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level4 level81)
(sum level77 level5 level82)
(sum level77 level6 level83)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level4 level82)
(sum level78 level5 level83)
(sum level78 level6 level84)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level4 level83)
(sum level79 level5 level84)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level4 level84)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level83 level1 level84)

(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l0 l5)
(fuelcost level8 l0 l5)
(connected l0 l6)
(fuelcost level4 l0 l6)
(connected l0 l7)
(fuelcost level9 l0 l7)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l8)
(fuelcost level22 l1 l8)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l7)
(fuelcost level19 l2 l7)
(connected l2 l9)
(fuelcost level2 l2 l9)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l5)
(fuelcost level9 l3 l5)
(connected l3 l7)
(fuelcost level21 l3 l7)
(connected l3 l9)
(fuelcost level1 l3 l9)
(connected l4 l5)
(fuelcost level9 l4 l5)
(connected l4 l6)
(fuelcost level23 l4 l6)
(connected l4 l8)
(fuelcost level1 l4 l8)
(connected l5 l0)
(fuelcost level8 l5 l0)
(connected l5 l3)
(fuelcost level9 l5 l3)
(connected l5 l4)
(fuelcost level9 l5 l4)
(connected l6 l0)
(fuelcost level4 l6 l0)
(connected l6 l4)
(fuelcost level23 l6 l4)
(connected l7 l0)
(fuelcost level9 l7 l0)
(connected l7 l2)
(fuelcost level19 l7 l2)
(connected l7 l3)
(fuelcost level21 l7 l3)
(connected l8 l1)
(fuelcost level22 l8 l1)
(connected l8 l4)
(fuelcost level1 l8 l4)
(connected l8 l9)
(fuelcost level6 l8 l9)
(connected l9 l2)
(fuelcost level2 l9 l2)
(connected l9 l3)
(fuelcost level1 l9 l3)
(connected l9 l8)
(fuelcost level6 l9 l8)

(at t0 l5)
(fuel t0 level84)
(= (total-cost) 0)

(at p0 l6)
(at p1 l4)
(at p2 l9)
(at p3 l1)
(at p4 l2)
)

(:goal
(and
(at p0 l7)
(at p1 l8)
(at p2 l7)
(at p3 l3)
(at p4 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l5 l4 level75 level9 level84)
   deleted: (at t0 l5) (fuel t0 level84)
   added: (at t0 l4) (fuel t0 level75)
   goals met: 0 of 5
2. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 5
3. (drive t0 l4 l8 level74 level1 level75)
   deleted: (at t0 l4) (fuel t0 level75)
   added: (at t0 l8) (fuel t0 level74)
   goals met: 0 of 5
4. (unload p1 t0 l8)
   deleted: (in p1 t0)
   added: (at p1 l8)
   goals met: 1 of 5
5. (drive t0 l8 l1 level52 level22 level74)
   deleted: (at t0 l8) (fuel t0 level74)
   added: (at t0 l1) (fuel t0 level52)
   goals met: 1 of 5
6. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 5
7. (drive t0 l1 l2 level47 level5 level52)
   deleted: (at t0 l1) (fuel t0 level52)
   added: (at t0 l2) (fuel t0 level47)
   goals met: 1 of 5
8. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 1 of 5
9. (drive t0 l2 l9 level45 level2 level47)
   deleted: (at t0 l2) (fuel t0 level47)
   added: (at t0 l9) (fuel t0 level45)
   goals met: 1 of 5
10. (load p2 t0 l9)
   deleted: (at p2 l9)
   added: (in p2 t0)
   goals met: 1 of 5
11. (drive t0 l9 l3 level44 level1 level45)
   deleted: (at t0 l9) (fuel t0 level45)
   added: (at t0 l3) (fuel t0 level44)
   goals met: 1 of 5
12. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 2 of 5
13. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 3 of 5
14. (drive t0 l3 l0 level36 level8 level44)
   deleted: (at t0 l3) (fuel t0 level44)
   added: (at t0 l0) (fuel t0 level36)
   goals met: 3 of 5
15. (drive t0 l0 l6 level32 level4 level36)
   deleted: (at t0 l0) (fuel t0 level36)
   added: (at t0 l6) (fuel t0 level32)
   goals met: 3 of 5
16. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 3 of 5
17. (drive t0 l6 l0 level28 level4 level32)
   deleted: (at t0 l6) (fuel t0 level32)
   added: (at t0 l0) (fuel t0 level28)
   goals met: 3 of 5
18. (drive t0 l0 l7 level19 level9 level28)
   deleted: (at t0 l0) (fuel t0 level28)
   added: (at t0 l7) (fuel t0 level19)
   goals met: 3 of 5
19. (unload p0 t0 l7)
   deleted: (in p0 t0)
   added: (at p0 l7)
   goals met: 4 of 5
20. (unload p2 t0 l7)
   deleted: (in p2 t0)
   added: (at p2 l7)
   goals met: 5 of 5
